***Tasks***

      Task-1: Frequency table development  without using Value counts


      Task-2: Create a Data frame from Value counts


      Task-3:  Create a Frequency table using Group By


      Task-4:  Write all categorical frequency tables in a new folder


      Task-5: Implement a Describe function with using method for Numerical columns


      Task-6: Two tables how to join them write all possible ways of implementation


                  a) Concatenation


                  b) Join


                  c) Arguments inside the function ON and Key


                  d) How to implement inner join and outer join operations


      Task-7:   Group By operations in Pandas

In [36]:
import numpy as np 
import pandas as pd
import os

In [14]:
visa = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Visadataset.csv")
visa.head(2)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified

In [12]:
cat = visa.select_dtypes(include="str").columns.tolist()
num = visa.select_dtypes(exclude = "str").columns.tolist()
visa_col = visa.columns.tolist()

#### ***Task = 1 :  frequency table development without using value_count()***

In [26]:
data = {
    
}

for val in visa["continent"] :
    if val in data :
        data[val] += 1 
    else :
        data[val] = 0 

pd.DataFrame([data.keys(), data.values()], index = ["continent", "frequencies"]).T.sort_values(by = "continent")

       continent frequencies
1         Africa         550
0           Asia       16860
3         Europe        3731
2  North America        3291
5        Oceania         191
4  South America         851

#### ***Task-2: Create a Data frame from Value counts***

In [28]:
pd.DataFrame([visa.continent.value_counts().index, visa.continent.value_counts().values], index = ["continent", "frequencies"]).T

       continent frequencies
0           Asia       16861
1         Europe        3732
2  North America        3292
3  South America         852
4         Africa         551
5        Oceania         192

#### ***Task-3:  Create a Frequency table using Group By***

In [35]:
pd.DataFrame([visa.groupby(by= "continent").count()["case_id"].index, visa.groupby(by= "continent").count()["case_id"].values], index = ["continent", "frequency"]).T

       continent frequency
0         Africa       551
1           Asia     16861
2         Europe      3732
3  North America      3292
4        Oceania       192
5  South America       852

#### ***Task-4:  Write all categorical frequency tables in a new folder***

In [ ]:
folder = "Task-4"
os.makedirs(folder, exist_ok=True)
path = os.path.join(os.getcwd(), folder)

'c:\\Users\\prath\\FullStackDataScience\\Data-Science\\pandas\\DataFrame\\Task-4'

In [ ]:
for i in cat[1:] : 
    pd.DataFrame([visa[i].value_counts().index, visa[i].value_counts().values], index = [i, "frequency"]).T.to_csv(f'{path}\\{i}.csv')

#### ***Task-5: Implement a Describe function with using method for Numerical columns***

In [57]:
property = ["count", 'mean', 'median', 'std', 'min', '25%', '50%', '75%', "max"]

data = {}

for i in num :
    data[i] = [visa[i].count(), visa[i].mean(), visa[i].median(), visa[i].std(), visa[i].min(), np.quantile(visa[i], 0.25), np.quantile(visa[i], 0.50), np.quantile(visa[i], 0.75), visa[i].max()]

pd.DataFrame(data, index = property)

        no_of_employees   yr_of_estab  prevailing_wage
count      25480.000000  25480.000000     25480.000000
mean        5667.043210   1979.409929     74455.814592
median      2109.000000   1997.000000     70308.210000
std        22877.928848     42.366929     52815.942327
min          -26.000000   1800.000000         2.136700
25%         1022.000000   1976.000000     34015.480000
50%         2109.000000   1997.000000     70308.210000
75%         3504.000000   2005.000000    107735.512500
max       602069.000000   2016.000000    319210.270000